Revit 2024 API
Transform.Inverse Property
The inverse transformation of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Transform Inverse { get; }
Visual Basic
Public ReadOnly Property Inverse As Transform
	Get
Visual C++
public:
property Transform^ Inverse {
	Transform^ get ();
}
Remarks
 The transformation matrix A is invertible if there exists a transformation matrix B such that A*B = B*A = I (identity).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when this transformation is not conformal or invertible.
See Also
Transform Class
Autodesk.Revit.DB Namespace